src/cf/InformationRegisters/ОбменРаббит.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбменРаббит</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектыВыгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыВыгрузкиВРаббит</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбменРаббитНастройкиМиграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбменРаббитНастройкиМиграции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОбъектыВыгрузкиМетаданные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ОбменРаббит/Ext/Module.bsl
Процедура ОтправитьСообщениеНаСервере() Экспорт
	
	Настройки = RebbitMQСервер.ПолучитьНастройкиПодключенияИзРегистра();
	Компонента = RebbitMQСервер.ПолучитьКомпоненту();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменРаббит.ОбъектыВыгрузки КАК ОбъектыВыгрузки,
		|	ОбменРаббит.ТочкаОбмена КАК ТочкаОбмена,
		|	ОбменРаббит.ИмяОчереди КАК ИмяОчереди,
		|	ОбменРаббит.КлючМаршрута КАК КлючМаршрута
		|ИЗ
		|	РегистрСведений.ОбменРаббит КАК ОбменРаббит";
	

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//ТекстJSON = RebbitMQКлиентСервер.СериализоватьВJSON(ВыборкаДетальныеЗаписи.ОбъектыВыгрузки);   
		ТекстJSON = "[{""Код"""+": "+СокрЛП(ВыборкаДетальныеЗаписи.ОбъектыВыгрузки.Код)+","
		+"""Наименование"""+": "+СокрЛП(ВыборкаДетальныеЗаписи.ОбъектыВыгрузки.Наименование)+","
		+"""Реквизит1"""+": "+СокрЛП(ВыборкаДетальныеЗаписи.ОбъектыВыгрузки.Реквизит1)
		+"}]";
		
		Настройки.ТочкаОбмена  = ВыборкаДетальныеЗаписи.ТочкаОбмена;
		Настройки.ИмяОчереди   = ВыборкаДетальныеЗаписи.ИмяОчереди;
		Настройки.КлючМаршрута = ВыборкаДетальныеЗаписи.КлючМаршрута;
		
		// Удалить отправленную запись регистра РегистрСведений.ОбменРаббит
		НачатьТранзакцию();
		Попытка
			RebbitMQКлиентСервер.ОтправитьСообщение(Компонента, Настройки, ТекстJSON);
			
			НаборЗаписейДляУдаления = РегистрыСведений.ОбменРаббит.СоздатьНаборЗаписей();
			ЗаполнитьЗначенияСвойств(НаборЗаписейДляУдаления,ВыборкаДетальныеЗаписи);
			
			//НаборЗаписейДляУдаления.Отбор.ОбъектыВыгрузки.Установить(ВыборкаДетальныеЗаписи.ОбъектыВыгрузки);
			
			НаборЗаписейДляУдаления.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
		

	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ПроведениеДокументов(Источник, Отказ) Экспорт

	
КонецПроцедуры


Процедура ЗаписьСправочников(Источник, Отказ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменРаббитНастройкиМиграции.ОбъектыВыгрузкиМетаданные КАК ОбъектыВыгрузкиМетаданные,
		|	ОбменРаббитНастройкиМиграции.ТочкаОбмена КАК ТочкаОбмена,
		|	ОбменРаббитНастройкиМиграции.ИмяОчереди КАК ИмяОчереди,
		|	ОбменРаббитНастройкиМиграции.КлючМаршрута КАК КлючМаршрута
		|ИЗ
		|	РегистрСведений.ОбменРаббитНастройкиМиграции КАК ОбменРаббитНастройкиМиграции
		|ГДЕ
		|	ОбменРаббитНастройкиМиграции.ОбъектыВыгрузкиМетаданные = &ОбъектыВыгрузкиМетаданные";
	
	Запрос.УстановитьПараметр("ОбъектыВыгрузкиМетаданные", Источник.Ссылка.Метаданные().Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		МенеджерРегистраСведений= РегистрыСведений.ОбменРаббит;
		МенеджерЗаписи = МенеджерРегистраСведений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ВыборкаДетальныеЗаписи);    
		МенеджерЗаписи.ОбъектыВыгрузки = Источник.Ссылка;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
